Revit 2027 API
AnnotationFamilyUtils Class
 Utility functions for elements in annotation families.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AnnotationFamilyUtils
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class AnnotationFamilyUtils
Public NotInheritable Class AnnotationFamilyUtils
public ref class AnnotationFamilyUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type AnnotationFamilyUtils = class end
The AnnotationFamilyUtils type exposes the following members.
Methods
Name | Description
HasExcludeFromLeaderOutline |  Checks if the element supports the EXCLUDE_FROM_LEADER_OUTLINE parameter.
HasLeaderSnapReference |  Checks if the element supports the LEADER_SNAP_REFERENCE parameter.
IsExcludedFromLeaderOutline |  Checks if the element is excluded from the annotation outline used by leaders.
IsLeaderSnapReference |  Checks if the element is a leader snap reference for annotation leader snapping.
SetIsExcludedFromLeaderOutline |  Sets if the element is excluded from the annotation outline used by leaders.
SetIsLeaderSnapReference |  Sets if the element is a leader snap reference for annotation leader snapping.
Top
See Also
Reference
Autodesk.Revit.DB Namespace